In [1]:
'''
life_expectancy_model_data.db
# Level 1 models
state_county_model_data         life_expectancy_by_county_data.csv
_133_year_race_sex_model_data    133_life-expectancy_reformatted.csv
state_sex_model_data            U.S._State_Life_Expectancy_by_Sex__2020.csv
nchs_year_race_sex_model_data   NCHS_-_Death_rates_and_life_expectancy_at_birth.csv
ssa_year_sex_model_data         SSA_Life_Expectancy_by_sex_1940_2080.csv
# Level 2 models
state_county_le_p_censustract_model_data            U.S._Life_Expectancy_at_Birth_by_State_and_Census_Tract_-_2010-2015.csv
state_sex_le_p_stderr_model_data              U.S._State_Life_Expectancy_by_Sex__2020.csv
nchs_year_race_sex_le_p_deathrate_model_data     NCHS_-_Death_rates_and_life_expectancy_at_birth.csv
#Level 3 models
state_county_censustract_model_data         U.S._Life_Expectancy_at_Birth_by_State_and_Census_Tract_-_2010-2015.csv
state_sex_stderr_model_data                 U.S._State_Life_Expectancy_by_Sex__2020.csv
nchs_year_race_sex_deathrate_model_data     NCHS_-_Death_rates_and_life_expectancy_at_birth.csv
ssa_year_sex_model_data                     SSA_Life_Expectancy_by_sex_1940_2080.csv
_133_year_race_sex_model_data               133_life-expectancy_reformatted.csv
'''

'\nlife_expectancy_model_data.db\n# Level 1 models\nstate_county_model_data         life_expectancy_by_county_data.csv\n_133_year_race_sex_model_data    133_life-expectancy_reformatted.csv\nstate_sex_model_data            U.S._State_Life_Expectancy_by_Sex__2020.csv\nnchs_year_race_sex_model_data   NCHS_-_Death_rates_and_life_expectancy_at_birth.csv\nssa_year_sex_model_data         SSA_Life_Expectancy_by_sex_1940_2080.csv\n# Level 2 models\nstate_county_le_p_censustract_model_data            U.S._Life_Expectancy_at_Birth_by_State_and_Census_Tract_-_2010-2015.csv\nstate_sex_le_p_stderr_model_data              U.S._State_Life_Expectancy_by_Sex__2020.csv\nnchs_year_race_sex_le_p_deathrate_model_data     NCHS_-_Death_rates_and_life_expectancy_at_birth.csv\n#Level 3 models\nstate_county_censustract_model_data         U.S._Life_Expectancy_at_Birth_by_State_and_Census_Tract_-_2010-2015.csv\nstate_sex_stderr_model_data                 U.S._State_Life_Expectancy_by_Sex__2020.csv\nnchs_year_race_sex_deathrate_model_data     NCHS_-_Death_rates_and_life_expectancy_at_birth.csv\nssa_year_sex_model_data                     SSA_Life_Expectancy_by_sex_1940_2080.csv\n_133_year_race_sex_model_data               133_life-expectancy_reformatted.csv\n'

In [2]:
import pandas as pd
import sqlite3

In [3]:
df0 = pd.read_csv('133_life-expectancy_reformatted.csv',encoding='latin-1')
df1 = pd.read_csv('life_expectancy_by_county_data.csv',encoding='latin-1')
df2 = pd.read_csv('NCHS_-_Death_rates_and_life_expectancy_at_birth.csv',encoding='latin-1')
df3 = pd.read_csv('SSA_Life_Expectancy_by_sex_1940_2080.csv',encoding='latin-1')
df4 = pd.read_csv('U.S._State_Life_Expectancy_by_Sex__2020.csv',encoding='latin-1')
df5 = pd.read_csv('U.S._Life_Expectancy_at_Birth_by_State_and_Census_Tract_-_2010-2015.csv',encoding='latin-1')

In [4]:
df2.head()

,Year,Race,Sex,Average Life Expectancy (Years),Age-adjusted Death Rate
0,1900,All Races,Both Sexes,47.3,2518.0
1,1901,All Races,Both Sexes,49.1,2473.1
2,1902,All Races,Both Sexes,51.5,2301.3
3,1903,All Races,Both Sexes,50.5,2379.0
4,1904,All Races,Both Sexes,47.6,2502.5

In [5]:
print(df2.info())
print(df4.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1071 entries, 0 to 1070
Data columns (total 5 columns):
 #   Column                           Non-Null Count  Dtype
---  ------                           --------------  -----
 0   Year                             1071 non-null   int64
 1   Race                             1071 non-null   object
 2   Sex                              1071 non-null   object
 3   Average Life Expectancy (Years)  1065 non-null   float64
 4   Age-adjusted Death Rate          1071 non-null   float64
dtypes: float64(2), int64(1), object(2)
memory usage: 42.0+ KB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 156 entries, 0 to 155
Data columns (total 6 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   State                       156 non-null    object
 1   Sex                         156 non-null    object
 2   LifeExpectancy              156 non-null    float64
 3   StandardError               153 non-null    float64
 4   LifeExpectancyQuartileLow   153 non-null    float64
 5   LifeExpectancyQuartileHigh  153 non-null    float64
dtypes: float64(4), object(2)
memory usage: 7.4+ KB
None

In [6]:
df4 = df4.drop(columns=['LifeExpectancyQuartileLow', 'LifeExpectancyQuartileHigh'])
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 156 entries, 0 to 155
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   State           156 non-null    object
 1   Sex             156 non-null    object
 2   LifeExpectancy  156 non-null    float64
 3   StandardError   153 non-null    float64
dtypes: float64(2), object(2)
memory usage: 5.0+ KB

In [27]:
df4 = df4[~df4.eq('United States').any(axis=1)]
df4.info()

<class 'pandas.core.frame.DataFrame'>
Index: 153 entries, 0 to 155
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   State           153 non-null    object
 1   Sex             153 non-null    object
 2   LifeExpectancy  153 non-null    float64
 3   StandardError   153 non-null    float64
dtypes: float64(2), object(2)
memory usage: 6.0+ KB

In [10]:
db_file = "life_expectancy_model_data.db"
conn = sqlite3.connect(db_file)

In [11]:
table_to_drop = "state_sex_le_p_stderr_model_data " 
# The f-string includes the necessary double quotes around the variable
sql_command = f'DROP TABLE "{table_to_drop}"'
# sql_command is now: DROP TABLE "state_sex_le_p_stderr_model_data "

conn.execute(sql_command) 
conn.commit()

OperationalError: no such table: state_sex_le_p_stderr_model_data

In [12]:
df4.to_sql("state_sex_le_p_stderr_model_data", conn, if_exists="replace", index=False)
conn.close()

In [13]:
conn = sqlite3.connect(db_file)
cursor = conn.cursor()
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
# Fetch all the results
tables = cursor.fetchall()
for table in tables:
    # The result is a tuple, so we access the first element
    print(table[0])

conn.close()

state_sex_model_data
state_county_model_data
nchs_year_race_sex_model_data
ssa_year_sex_model_data
133_year_race_sex_model_data
year_race_sex_133_model_data
_133_year_race_sex_model_data
state_county_le_p_censustract_model_data
nchs_year_race_sex_le_p_deathrate_model_data
state_sex_le_p_stderr_model_data
state_sex_le_p_stderr_model_data

In [14]:
# Connect to your database
conn = sqlite3.connect("life_expectancy_model_data.db")
cursor = conn.cursor()

# Find all tables that start with "state_sex_le_p"
cursor.execute("""
    SELECT name 
    FROM sqlite_master 
    WHERE type='table' AND name LIKE 'state_sex_le_p%';
""")
tables = cursor.fetchall()

# Drop each table
for (table_name,) in tables:
    print(f"Dropping table: {table_name}")
    cursor.execute(f"DROP TABLE IF EXISTS {table_name}")

# Commit changes and close
conn.commit()
conn.close()

Dropping table: state_sex_le_p_stderr_model_data
Dropping table: state_sex_le_p_stderr_model_data

In [22]:
df2_ = df2.rename(columns={'Average Life Expectancy (Years)': 'LifeExpectancy',  'Age-adjusted Death Rate': 'DeathRate'})
df2_.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1071 entries, 0 to 1070
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Year            1071 non-null   int64
 1   Race            1071 non-null   object
 2   Sex             1071 non-null   object
 3   LifeExpectancy  1065 non-null   float64
 4   DeathRate       1071 non-null   float64
dtypes: float64(2), int64(1), object(2)
memory usage: 42.0+ KB

In [23]:
df2_['LifeExpectancy'].interpolate(method='linear', inplace=True)
df2_.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1071 entries, 0 to 1070
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Year            1071 non-null   int64
 1   Race            1071 non-null   object
 2   Sex             1071 non-null   object
 3   LifeExpectancy  1071 non-null   float64
 4   DeathRate       1071 non-null   float64
dtypes: float64(2), int64(1), object(2)
memory usage: 42.0+ KB

In [24]:
db_file = "life_expectancy_model_data.db"
conn = sqlite3.connect(db_file)
df2_.to_sql("nchs_year_race_sex_le_p_deathrate_model_data", conn, if_exists="replace", index=False)
conn.close()

In [5]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73121 entries, 0 to 73120
Data columns (total 6 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   State                        73121 non-null  object
 1   County                       73121 non-null  object
 2   CensusTract                  73070 non-null  float64
 3   LifeExpectancy               67199 non-null  float64
 4   LifeExpectancyRange          67199 non-null  object
 5   LifeExpectancyStandardError  67199 non-null  float64
dtypes: float64(3), object(3)
memory usage: 3.3+ MB

In [7]:
df5 = df5[~df5.eq('(blank)').any(axis=1)]
df5 = df5.drop(columns=['LifeExpectancyStandardError', 'LifeExpectancyRange'])
df5.info()

<class 'pandas.core.frame.DataFrame'>
Index: 73070 entries, 1 to 73120
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   State           73070 non-null  object
 1   County          73070 non-null  object
 2   CensusTract     73070 non-null  float64
 3   LifeExpectancy  67148 non-null  float64
dtypes: float64(2), object(2)
memory usage: 2.8+ MB

In [8]:
df5.head()

     State              County  CensusTract  LifeExpectancy
1  Alabama  Autauga County, AL        201.0            73.1
2  Alabama  Autauga County, AL        202.0            76.9
3  Alabama  Autauga County, AL        203.0             NaN
4  Alabama  Autauga County, AL        204.0            75.4
5  Alabama  Autauga County, AL        205.0            79.4

In [9]:
df5['LifeExpectancy'].interpolate(method='linear', inplace=True)
df5.info()

<class 'pandas.core.frame.DataFrame'>
Index: 73070 entries, 1 to 73120
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   State           73070 non-null  object
 1   County          73070 non-null  object
 2   CensusTract     73070 non-null  float64
 3   LifeExpectancy  73070 non-null  float64
dtypes: float64(2), object(2)
memory usage: 2.8+ MB

In [10]:
df5.isnull().sum().sum()

np.int64(0)

In [11]:
db_file = "life_expectancy_model_data.db"
conn = sqlite3.connect(db_file)
df5.to_sql("state_county_le_p_censustract_model_data", conn, if_exists="replace", index=False)
conn.close()

In [9]:
df0.head(2)

   Year       Race         Sex  LifeExpectancy
0  1940  All Races  Both Sexes            62.9
1  1940  All Races      Female            65.2

In [10]:
df1.head(2)

     State          County  LifeExpectancy  LifeExpectancyStandardError
0  Alabama  Autauga County       75.818245                     1.721689
1  Alabama  Baldwin County       77.560263                     1.594572

In [11]:
df2.head(2)

,Year,Race,Sex,Average Life Expectancy (Years),Age-adjusted Death Rate
0,1900,All Races,Both Sexes,47.3,2518.0
1,1901,All Races,Both Sexes,49.1,2473.1

In [12]:
df3.head(2)

   Year   Sex  LifeExpectancy
0  1940  Male            61.4
1  1941  Male            61.9

In [13]:
df4.head(2)

,State,Sex,LifeExpectancy,StandardError,LifeExpectancyQuartileLow,LifeExpectancyQuartileHigh
0,Alabama,Both Sexes,73.2,0.067,71.9,75.3
1,Alaska,Both Sexes,76.6,0.176,75.4,76.8

In [15]:
df_filtered = df4[df4['State'] != 'United States']

In [16]:
df4a = df_filtered.drop(columns=['StandardError','LifeExpectancyQuartileLow','LifeExpectancyQuartileHigh'])

In [17]:
db_file = "life_expectancy_model_data.db"

In [18]:
conn = sqlite3.connect(db_file)
df4a.to_sql("state_sex_model_data", conn, if_exists="replace", index=False)
conn.close()

In [19]:
conn = sqlite3.connect(db_file)
df0.to_sql("133_year_race_sex_model_data", conn, if_exists="replace", index=False)
conn.close()

In [20]:
df1a = df1.drop(columns=['LifeExpectancyStandardError'])

In [21]:
conn = sqlite3.connect(db_file)
df1a.to_sql("state_county_model_data", conn, if_exists="replace", index=False)
conn.close()

In [23]:
df2a = df2.drop(columns=['Age-adjusted Death Rate'])
df2b = df2a.rename(columns={"Average Life Expectancy (Years)": "LifeExpectancy"})
df2b.head(2)

   Year       Race         Sex  LifeExpectancy
0  1900  All Races  Both Sexes            47.3
1  1901  All Races  Both Sexes            49.1

In [24]:
conn = sqlite3.connect(db_file)
df2b.to_sql("nchs_year_race_sex_model_data", conn, if_exists="replace", index=False)
conn.close()

In [25]:
conn = sqlite3.connect(db_file)
df3.to_sql("ssa_year_sex_model_data", conn, if_exists="replace", index=False)
conn.close()

In [26]:
conn = sqlite3.connect(db_file)
sql_query = """SELECT name FROM sqlite_master  
  WHERE type='table';"""
cursor = conn.cursor()
cursor.execute(sql_query)

In [27]:
print(cursor.fetchall())

[('state_sex_model_data',), ('133_year_race_sex_model_data',), ('state_county_model_data',), ('nchs_year_race_sex_model_data',), ('ssa_year_sex_model_data',)]

In [31]:
conn = sqlite3.connect(db_file)

In [33]:
df_state= pd.read_sql("SELECT * FROM state_county_model_data", conn)

In [35]:
df_state_sex= pd.read_sql("SELECT * FROM state_sex_model_data", conn)
df_nchs = pd.read_sql("SELECT * FROM nchs_year_race_sex_model_data", conn)
df_ssa = pd.read_sql("SELECT * FROM ssa_year_sex_model_data", conn)

In [36]:
print(cursor.fetchall())

[]

In [37]:
cursor = conn.cursor()
cursor.execute(sql_query)

In [38]:
print(cursor.fetchall())

[('state_sex_model_data',), ('133_year_race_sex_model_data',), ('state_county_model_data',), ('nchs_year_race_sex_model_data',), ('ssa_year_sex_model_data',)]

In [39]:
df0.head(2)

   Year       Race         Sex  LifeExpectancy
0  1940  All Races  Both Sexes            62.9
1  1940  All Races      Female            65.2

In [40]:
df0.to_sql("133_year_race_sex_model_data", conn, if_exists="replace", index=False)

702

In [43]:
df0.to_sql("year_race_sex_133_model_data", conn, if_exists="replace", index=False)

702

In [44]:
df_133 = pd.read_sql("SELECT * FROM year_race_sex_133_model_data", conn)

In [45]:
df0.to_sql("_133_year_race_sex_model_data", conn, if_exists="replace", index=False)

702

In [46]:
df_133 = pd.read_sql("SELECT * FROM _133_year_race_sex_model_data", conn)

In [47]:
df_state_sex= pd.read_sql("SELECT * FROM state_sex_model_data", conn)
df_nchs = pd.read_sql("SELECT * FROM nchs_year_race_sex_model_data", conn)
df_ssa = pd.read_sql("SELECT * FROM ssa_year_sex_model_data", conn)
df_133 = pd.read_sql("SELECT * FROM _133_year_race_sex_model_data", conn)
df_county = pd.read_sql("SELECT * FROM state_county_model_data", conn)
conn.close()

In [49]:
print(df_state_sex.head(2))

     State         Sex  LifeExpectancy
0  Alabama  Both Sexes            73.2
1   Alaska  Both Sexes            76.6

In [50]:
print(df_nchs.head(2))

   Year       Race         Sex  LifeExpectancy
0  1900  All Races  Both Sexes            47.3
1  1901  All Races  Both Sexes            49.1

In [51]:
print(df_ssa.head(2))

   Year   Sex  LifeExpectancy
0  1940  Male            61.4
1  1941  Male            61.9

In [52]:
print(df_133.head(2))

   Year       Race         Sex  LifeExpectancy
0  1940  All Races  Both Sexes            62.9
1  1940  All Races      Female            65.2

In [53]:
print(df_county.head(2))

     State          County  LifeExpectancy
0  Alabama  Autauga County       75.818245
1  Alabama  Baldwin County       77.560263